html/4_Control_Flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-28 Mon 21:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>4. Control Flow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Paul Gribble" />
<link rel="stylesheet" type="text/css" href="mystyle.css" /></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://www.gribblelab.org/CBootCamp/index.html"> UP </a>
 |
 <a accesskey="H" href="http://www.gribblelab.org/CBootCamp/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">4. Control Flow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7bee981">Loops</a>
<ul>
<li><a href="#orgb93016c">For Loop</a></li>
<li><a href="#orgab0f05b">While Loop</a></li>
<li><a href="#org6d06068">Do-While Loop</a></li>
</ul>
</li>
<li><a href="#org39b2c81">Conditionals</a>
<ul>
<li><a href="#orgc00790e">If Statement</a></li>
<li><a href="#org1dff80b">Else</a></li>
<li><a href="#org0d6349c">Else If</a></li>
<li><a href="#org9cef974">The Conditional Operator</a></li>
</ul>
</li>
<li><a href="#org69ac51f">Switch</a></li>
<li><a href="#orgb82754f">Break &amp; Continue</a></li>
<li><a href="#org0d78840">Exercises</a>
<ul>
<li><a href="#orged30fc1">Solutions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org7bee981" class="outline-2">
<h2 id="org7bee981">Loops</h2>
<div class="outline-text-2" id="text-org7bee981">
<p>
One of the most useful properties of progammable computers is that you
can ask them to repeat a calculation and/or operation many many times,
and they will not (usually) complain. The looping constructs in <code>C</code>
allow us to repeatedly execute a block of code many times, without
having to manually re-type or re-list the code by hand.
</p>

<p>
As a simple example, let's say we want to compute the cumulative sum
of integers between 1 and 100. We could write code like the following:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">cumsum</span> = 0;
cumsum = cumsum + 1;
cumsum = cumsum + 2;
cumsum = cumsum + 3;
...
cumsum = cumsum + 100;
</pre>
</div>

<p>
As you can see, not very efficient. As a general rule of programming,
any time you find yourself copying and pasting code bits many times
over, you should be thinking to yourself, there must be a better way,
there must be a way to specify this code more abstractly so that it's
more compact and reusable. Here, we can use a for-loop to achieve what
we need.
</p>
</div>

<div id="outline-container-orgb93016c" class="outline-3">
<h3 id="orgb93016c">For Loop</h3>
<div class="outline-text-3" id="text-orgb93016c">
<p>
A generic for-loop looks like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">for</span> (init_expression; loop_condition; loop_expression) {
  program_statements
}
</pre>
</div>

<p>
The three expressions inside the round brackets set up the environment
for the loop. The <code>init_expression</code> is executed before the loop starts
and is typically where you define some initial value that will change
each time through the loop. The <code>loop_condition</code> is an expression that
determines whether the loop should continue, or stop. Of course if you
don't specify a condition under which the loop should stop, it never
will, and you will have an <b>endless loop</b> and your program will never
terminate. The <code>loop_expression</code> specifies code that is executed each
time through the loop, <b>after</b> the body of the loop is executed. This
is all very abstract, so let's see a concrete example, by coding a
loop to implement the cumulative sum as above.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">cumsum</span> = 0;
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
        <span style="color: #a020f0;">for</span> (i=1; i&lt;=100; i++) {
                cumsum = cumsum + i;
        }
        printf(<span style="color: #8b2252;">"the cumulative sum up to 100 is %d\n"</span>, cumsum);
}
</pre>
</div>

<pre class="example">
the cumulative sum up to 100 is 5050
</pre>

<p>
Let's go through the code for the for-loop and understand what is
happening. On lines 4 and 5 we declare the integer variables <code>cumsum</code>
and <code>i</code>, and we initialize the value of <code>cumsum</code> to <code>0</code>. On line 6 we
declare the for-loop. The first expression in the round brackets is a
statement which initializes the value of the <code>i</code> variable to be
<code>1</code>. This is executed before the loop starts. The next expression is a
conditional which is <code>TRUE</code> if <code>i</code> is less than or equal to <code>100</code> and
is <code>FALSE</code> otherwise. This expression is evaluated prior to each
iteration of the loop. When this expression is <code>FALSE</code> the loop
terminates, otherwise the loop iterates again. Finally the third
expression in the round brackets, <code>i++</code> is executed <b>after</b> each
iteration of the loop. In this case, we increment the <code>i</code> variable by
one.
</p>

<p>
On line 7 is the code block that forms the body of the loop. This is
code that is executed on each iteration of the loop. In this case we
add the current value of <code>i</code> (which changes each time through the
loop) to the <code>cumsum</code> variable. On line 8 the closing bracket <code>}</code>
specifies the end of the body of the loop. On line 9 we print to the
screen the value of the <code>cumsum</code> variable.
</p>

<p>
As you can see, the use of a for-loop enables us to write the code for
incrementing the <code>cumsum</code> variable just <b>once</b>, and place it inside a
loop, that is constructed so that it executes that code 100 times, and
each time, uses a different value of <code>i</code>.
</p>
</div>
</div>

<div id="outline-container-orgab0f05b" class="outline-3">
<h3 id="orgab0f05b">While Loop</h3>
<div class="outline-text-3" id="text-orgab0f05b">
<p>
The while-loop is another looping construct that you might find more
appropriate than a for-loop under some circumstances. A while-loop
looks like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">while</span> (conditional_expression) {
   program_statements;
}
</pre>
</div>

<p>
The while-loop will first check the value of the
<code>conditional_expression</code>, and if it is <b>not FALSE</b> (i.e. if the
expression returns a <b>non-zero</b> (non-FALSE) result, the
<code>program_statement</code> (or multiple statements) will be executed
once. Afterwards the <code>conditional_expression</code> will be evaluated again,
and if it returns a non-zero result, the <code>program_statment</code> (or
multiple statements) will be executed again, and so on. The while-loop
will stop <b>only</b> when the <code>conditional_expression</code> returns <b>zero</b>.
</p>

<p>
Here is a simple program that demonstrates the use of a while-loop:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">number</span> = 0;
        <span style="color: #a020f0;">while</span>(number != 999) {
                printf(<span style="color: #8b2252;">"Enter an integer or 999 to stop: "</span>);
                scanf (<span style="color: #8b2252;">"%i"</span>, &amp;number);
                printf(<span style="color: #8b2252;">"%d x 10 = %d\n"</span>, number, <span style="color: #228b22;">number</span>*10);
        }
}
</pre>
</div>

<p>
The program asks the user to enter an integer, and then the program
prints to the screen the value of the integer multiplied by 10. If the
user enters <code>999</code> then the program terminates. Enter it into your code
editor and compile and run it, to see how it works.
</p>
</div>
</div>

<div id="outline-container-org6d06068" class="outline-3">
<h3 id="org6d06068">Do-While Loop</h3>
<div class="outline-text-3" id="text-org6d06068">
<p>
There is another version of a while-loop that is essentially the same
as a while-loop but it reverses the order of the <code>program_statement</code>
and <code>conditional_expression</code>:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">number</span> = 0;
        <span style="color: #a020f0;">do</span> {
                printf(<span style="color: #8b2252;">"Enter an integer or 999 to stop: "</span>);
                scanf (<span style="color: #8b2252;">"%i"</span>, &amp;number);
                printf(<span style="color: #8b2252;">"%d x 10 = %d\n"</span>, number, <span style="color: #228b22;">number</span>*10);
        }
        <span style="color: #a020f0;">while</span> (number != 999);
}
</pre>
</div>

<p>
The choice of a for-loop, a while-loop, or a do-while-loop, is up to
you and the best one to use may differ depending on circumstance.
</p>
</div>
</div>
</div>
