org/4_Control_Flow.org
* Conditionals

One of the most important constructs in programming is the ability to
execute (or not execute) pieces of code, or execute different pieces
of code, depending on the outcome of some decision or question about
data. The if-else construct lets us to this in C.

** If Statement

The basic if statement looks like this:

#+BEGIN_SRC c
if (conditional_expression) {
   program_statements;
}
#+END_SRC

The =program_statements= are *only* executed if the
=conditional_expression= returns a non-zero value, i.e. if it returns
a value that is *not FALSE* (FALSE = zero).

For example, here is a simple program that loops through the integers
between 1 and 10 and prints to the screen the integers that are odd
(that are not divisible by 2 with zero remainder):

#+BEGIN_SRC c
#include <stdio.h>

int main() {
  int i;
  for (i=1; i<=10; i++) {
    if ((i % 2) != 0) {
      printf("%d is odd\n", i);
    }
  }
}
#+END_SRC

#+BEGIN_EXAMPLE
1 is odd
3 is odd
5 is odd
7 is odd
9 is odd
#+END_EXAMPLE

** Else

We can add an *else* to our if statement, to execute a different code
block if the value of the =conditional_expression= is zero:

#+BEGIN_SRC c
#include <stdio.h>

int main() {
  int i;
  for (i=1; i<=10; i++) {
    if ((i % 2) != 0) {
      printf("%d is odd\n", i);
    }
    else {
      printf("%d is even\n", i);
    }
  }
}
#+END_SRC

#+BEGIN_EXAMPLE
1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even
#+END_EXAMPLE

** Else If

You can string together several conditional tests and execute
different pieces of code by using the =else if= construct. Here is a
simple program that asks the user to enter an integer, and prints to
the screen whether that integer is positive, negative, or zero:

#+BEGIN_SRC c
#include <stdio.h>

int main() {
	int number;
	printf("enter an integer: ");
	scanf ("%i", &number);
	if (number < 0) {
		printf("the integer %d is negative\n", number);
	}
	else if (number > 0) {
		printf("the integer %d is positive\n", number);
	}
	else if (number == 0) {
		printf("the integer %d is zero\n", number);
	}
	else {
		printf("this statement should never be executed!\n");
	}
}
#+END_SRC

#+BEGIN_EXAMPLE
enter an integer: 123
the integer 123 is positive
#+END_EXAMPLE


** The Conditional Operator

There is a convenient shorthand for simple if-else constructs, using
the so-called *conditional operator*:

#+BEGIN_SRC c
condition ? expression1 : expression2
#+END_SRC

It enables you to shorten your code a bit, but that's all. It doesn't
give you any additional functionality, it's just a shorthand:

#+BEGIN_SRC c
#include <stdio.h>

int main() {
  int i;
  for (i=1; i<=10; i++) {
	(i % 2) ? printf("%d is odd\n", i) : printf("%d is even\n", i);
  }
}
#+END_SRC

#+BEGIN_EXAMPLE
1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even
#+END_EXAMPLE

* Switch

The case of multiple if-else statements strung together to test for
different values, and execute different code, is common enough that
there is a special construct called the *switch statment* that is
provided for this case:

#+BEGIN_SRC c
switch (expression)
{
   case value1:
              program statement;
              program statement;
              ...
              break;
   case value2:
              program statement;
              program statement;
              ...
              break;
   case value3:
              program statement;
              program statement;
              ...
              break;
   default:
              program statement;
              program statement;
              ...
              break;
}
#+END_SRC

This is equivalent to the following series of if-else statements:

#+BEGIN_SRC c
if (expression == value1) {
   program statement;
   program statement;
   ...
}
else if (expression == value2) {
   program statement;
   program statement;
   ...
}
else if (expression == value3) {
   program statement;
   program statement;
   ...
}
else {
   program statement;
   program statement;
   ...
}
#+END_SRC

From my point of view the decision to use a switch statement versus a
series of if-else statements is purely stylistic and is up to
you. They accomplish the same thing.

* Break & Continue

There is a special statement in C called =break= that allows you to
exit from a loop other than by testing at the top or bottom. As we saw
above in switch statements we also use =break= to exit from each case.

The =continue= statement is not used very often. It causes the next
iteration of a loop to begin. You can think of it as a sort of a
statement to "do nothing, just continue".

