html/4_Control_Flow.html

<div id="outline-container-org39b2c81" class="outline-2">
<h2 id="org39b2c81">Conditionals</h2>
<div class="outline-text-2" id="text-org39b2c81">
<p>
One of the most important constructs in programming is the ability to
execute (or not execute) pieces of code, or execute different pieces
of code, depending on the outcome of some decision or question about
data. The if-else construct lets us to this in C.
</p>
</div>

<div id="outline-container-orgc00790e" class="outline-3">
<h3 id="orgc00790e">If Statement</h3>
<div class="outline-text-3" id="text-orgc00790e">
<p>
The basic if statement looks like this:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">if</span> (conditional_expression) {
   program_statements;
}
</pre>
</div>

<p>
The <code>program_statements</code> are <b>only</b> executed if the
<code>conditional_expression</code> returns a non-zero value, i.e. if it returns
a value that is <b>not FALSE</b> (FALSE = zero).
</p>

<p>
For example, here is a simple program that loops through the integers
between 1 and 10 and prints to the screen the integers that are odd
(that are not divisible by 2 with zero remainder):
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=1; i&lt;=10; i++) {
    <span style="color: #a020f0;">if</span> ((i % 2) != 0) {
      printf(<span style="color: #8b2252;">"%d is odd\n"</span>, i);
    }
  }
}
</pre>
</div>

<pre class="example">
1 is odd
3 is odd
5 is odd
7 is odd
9 is odd
</pre>
</div>
</div>

<div id="outline-container-org1dff80b" class="outline-3">
<h3 id="org1dff80b">Else</h3>
<div class="outline-text-3" id="text-org1dff80b">
<p>
We can add an <b>else</b> to our if statement, to execute a different code
block if the value of the <code>conditional_expression</code> is zero:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=1; i&lt;=10; i++) {
    <span style="color: #a020f0;">if</span> ((i % 2) != 0) {
      printf(<span style="color: #8b2252;">"%d is odd\n"</span>, i);
    }
    <span style="color: #a020f0;">else</span> {
      printf(<span style="color: #8b2252;">"%d is even\n"</span>, i);
    }
  }
}
</pre>
</div>

<pre class="example">
1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even
</pre>
</div>
</div>

<div id="outline-container-org0d6349c" class="outline-3">
<h3 id="org0d6349c">Else If</h3>
<div class="outline-text-3" id="text-org0d6349c">
<p>
You can string together several conditional tests and execute
different pieces of code by using the <code>else if</code> construct. Here is a
simple program that asks the user to enter an integer, and prints to
the screen whether that integer is positive, negative, or zero:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">number</span>;
        printf(<span style="color: #8b2252;">"enter an integer: "</span>);
        scanf (<span style="color: #8b2252;">"%i"</span>, &amp;number);
        <span style="color: #a020f0;">if</span> (number &lt; 0) {
                printf(<span style="color: #8b2252;">"the integer %d is negative\n"</span>, number);
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (number &gt; 0) {
                printf(<span style="color: #8b2252;">"the integer %d is positive\n"</span>, number);
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (number == 0) {
                printf(<span style="color: #8b2252;">"the integer %d is zero\n"</span>, number);
        }
        <span style="color: #a020f0;">else</span> {
                printf(<span style="color: #8b2252;">"this statement should never be executed!\n"</span>);
        }
}
</pre>
</div>

<pre class="example">
enter an integer: 123
the integer 123 is positive
</pre>
</div>
</div>


<div id="outline-container-org9cef974" class="outline-3">
<h3 id="org9cef974">The Conditional Operator</h3>
<div class="outline-text-3" id="text-org9cef974">
<p>
There is a convenient shorthand for simple if-else constructs, using
the so-called <b>conditional operator</b>:
</p>

<div class="org-src-container">
<pre class="src src-c">condition ? expression1 : expression2
</pre>
</div>

<p>
It enables you to shorten your code a bit, but that's all. It doesn't
give you any additional functionality, it's just a shorthand:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=1; i&lt;=10; i++) {
        (i % 2) ? printf(<span style="color: #8b2252;">"%d is odd\n"</span>, i) : printf(<span style="color: #8b2252;">"%d is even\n"</span>, i);
  }
}
</pre>
</div>

<pre class="example">
1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even
</pre>
</div>
</div>
</div>

<div id="outline-container-org69ac51f" class="outline-2">
<h2 id="org69ac51f">Switch</h2>
<div class="outline-text-2" id="text-org69ac51f">
<p>
The case of multiple if-else statements strung together to test for
different values, and execute different code, is common enough that
there is a special construct called the <b>switch statment</b> that is
provided for this case:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">switch</span> (expression)
{
   <span style="color: #a020f0;">case</span> value1:
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              ...
              <span style="color: #a020f0;">break</span>;
   <span style="color: #a020f0;">case</span> value2:
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              ...
              <span style="color: #a020f0;">break</span>;
   <span style="color: #a020f0;">case</span> value3:
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              ...
              <span style="color: #a020f0;">break</span>;
   <span style="color: #a020f0;">default</span>:
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
              ...
              <span style="color: #a020f0;">break</span>;
}
</pre>
</div>

<p>
This is equivalent to the following series of if-else statements:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">if</span> (expression == value1) {
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   ...
}
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (expression == value2) {
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   ...
}
<span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (expression == value3) {
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   ...
}
<span style="color: #a020f0;">else</span> {
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   <span style="color: #228b22;">program</span> <span style="color: #a0522d;">statement</span>;
   ...
}
</pre>
</div>

<p>
From my point of view the decision to use a switch statement versus a
series of if-else statements is purely stylistic and is up to
you. They accomplish the same thing.
</p>
</div>
</div>

<div id="outline-container-orgb82754f" class="outline-2">
<h2 id="orgb82754f">Break &amp; Continue</h2>
<div class="outline-text-2" id="text-orgb82754f">
<p>
There is a special statement in C called <code>break</code> that allows you to
exit from a loop other than by testing at the top or bottom. As we saw
above in switch statements we also use <code>break</code> to exit from each case.
</p>

<p>
The <code>continue</code> statement is not used very often. It causes the next
iteration of a loop to begin. You can think of it as a sort of a
statement to "do nothing, just continue".
</p>
</div>
</div>
